///Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
//Не использовать строки для расчета.

int n = 678;
Console.WriteLine($"Вторая цифра числа {n} = {n / 10 % 10}");
Console.ReadKey(); 

