// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

double a = 10;
double b = 20;
double c = 30;
Console.WriteLine($"Максемальное число {Math.Max(a, Math.Max(b, c))}");
Console.ReadKey();
