//Задача 3: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

int day = 6;
if (day > 5)
Console.WriteLine("да");
Console.ReadKey();